app/Models/PersonalModel.php

SELECT "e"."personal_info_id", "e"."firstname", "e"."lastname", "e"."fathername", "d"."date_of_joining", "d"."department"
FROM "personal_info" "e"
LEFT JOIN "joining_info" "d" ON "d"."personal_info_id" = "e"."personal_info_id"
ORDER BY "e"."personal_info_id" DESC
---
    public function getEmployeeWithDetails()
    {
        return $this->db->table('personal_info e')
            ->select('e.personal_info_id, e.firstname, e.lastname, e.fathername, d.date_of_joining, d.department')
            ->join('joining_info d', 'd.personal_info_id = e.personal_info_id', 'left')
            ->orderBy('e.personal_info_id', 'DESC')
            ->get()
            ->getResult();

SELECT *
FROM "personal_info"
WHERE "personal_info_id" = '172'
SELECT *
FROM "iden_details"
WHERE "personal_info_id" = '172'
SELECT *
FROM "qualification_info"
WHERE "personal_info_id" = '172'
SELECT *
FROM "address_info"
WHERE "personal_info_id" = '172'
SELECT *
FROM "family_info"
WHERE "personal_info_id" = '172'
SELECT *
FROM "accounts_info"
WHERE "personal_info_id" = '172'
SELECT *
FROM "emergency_info"
WHERE "personal_info_id" = '172'
SELECT *
FROM "joining_info"
WHERE "personal_info_id" = '172'
SELECT *
FROM "compliance_info"
WHERE "personal_info_id" = '172'
SELECT *
FROM "upload_info"
WHERE "personal_info_id" = '172'
---
    public function getEmployeeDetails($personalInfoId)
    {
        // Master Table
        $personal = $this->db->table('personal_info')
            ->where('personal_info_id', $personalInfoId)
            ->get()
            ->getRowArray();

        if (!$personal) {
            return null; // Agar record hi nahi mila
        }
        // Related Tables (foreign key = personal_info_id)
        $identity = $this->db->table('iden_details')->where('personal_info_id', $personalInfoId)->get()->getResultArray();
        $qualification = $this->db->table('qualification_info')->where('personal_info_id', $personalInfoId)->get()->getResultArray();
        $address = $this->db->table('address_info')->where('personal_info_id', $personalInfoId)->get()->getResultArray();
        $family = $this->db->table('family_info')->where('personal_info_id', $personalInfoId)->get()->getResultArray();
        $accounts = $this->db->table('accounts_info')->where('personal_info_id', $personalInfoId)->get()->getResultArray();
        $emergency = $this->db->table('emergency_info')->where('personal_info_id', $personalInfoId)->get()->getResultArray();
        $joining = $this->db->table('joining_info')->where('personal_info_id', $personalInfoId)->get()->getResultArray();
        $compliance = $this->db->table('compliance_info')->where('personal_info_id', $personalInfoId)->get()->getResultArray();
        $uploads = $this->db->table('upload_info')->where('personal_info_id', $personalInfoId)->get()->getResultArray();

SELECT "name", "relation", "contact_no"
FROM "emergency_info"
WHERE "personal_info_id" = '172'
AND "isactive" = TRUE
---
    public function getEmergencyContacts($personalInfoId)
    {
        return $this->db->table('emergency_info')
            ->select('name, relation, contact_no')
            ->where('personal_info_id', $personalInfoId)
            ->where('isactive', true)
            ->get()

SELECT "qualification_level", "board_university", "passing_year"
FROM "qualification_info"
WHERE "personal_info_id" = '172'
ORDER BY "id" ASC
---
    public function getQualifications($personalInfoId)
    {
        return $this->db->table('qualification_info')
            ->select('qualification_level, board_university, passing_year')
            ->where('personal_info_id', $personalInfoId)
            ->orderBy('id', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM "family_info"
WHERE "personal_info_id" = '172'
---
    public function getFamilyDetails($personalInfoId)
    {
        return $this->db->table('family_info')
            ->where('personal_info_id', $personalInfoId)
            ->get()
            ->getResultArray();